Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/P22.tmx
Source language: en_us
Languages: zh_cn

source: I love girl
zh_cn: 恋爱中的原始人

source: I am Oog.
zh_cn: 我叫奥戈。

source: I love Girl.
zh_cn: 我爱女孩。

source: Girl loves Boog.
zh_cn: 女孩爱波戈。

source: It is bad situation.
zh_cn: 这是坏情况。

source: Boog and I are very different people.
zh_cn: 我跟波戈很不一样。

source: For example, we have different jobs.
zh_cn: 比如，我们的工作不同。

source: My job is Rock Thrower.
zh_cn: 我的工作是扔石头。

source: I will explain what that is.
zh_cn: 我会解释的。

source: There are many rocks all over the place and people are always tripping on them.
zh_cn: 这地方到处都是石头，老是拌着人。

source: So when I became a man, at age eleven, the Old Person said to me, "Get rid of all the rocks."
zh_cn: 所以当我十一岁，成为一个大人时，老人对我说，“弄走这些石头。”

source: Since that day, ten years ago, I have worked very hard at this.
zh_cn: 从那天起，十年前，我就开始非常努力地扔石头。

source: Whenever it is light outside, I am gathering rocks and throwing them off the cliff.
zh_cn: 只要外面亮着天，我就去捡石头，把它们都扔到山崖下面去。

source: Boog's job is Artist.
zh_cn: 波戈是个艺术家。

source: When he became a man, the Old Person said to him, "Cut down the trees so we have space to live."
zh_cn: 当他长大的时候，老人对他说，“把那些树砍了，这样我们就有地方住啦。”

source: But Boog did not want to do this, so now he smears paint inside caves. He calls his smears "pictures."
zh_cn: 但是波戈不想干，他就在洞里乱抹颜料，他把他抹出来的东西叫做“画”。

source: Everybody likes to look at them.
zh_cn: 所有人都喜欢看“画”。

source: But the person who likes to look at them most is Girl.
zh_cn: 但最喜欢看“画”的人是女孩。

source: When I look at her, I feel sick like I am going to die.
zh_cn: 我看着她的时候，感觉就像是要死了一样难受。

source: I have never had the Great Disease (obviously, because I am still alive).
zh_cn: 我还从来没有得过天大的病（这很明显，因为我还活着）。

source: But my uncle described it to me.
zh_cn: 但我舅舅跟我描述过天大的病。

source: He said there is a tightness in your chest, you cannot breathe, and you have anger toward the Gods.
zh_cn: 他说，你觉得胸口发紧，无法呼吸，你对诸神感到愤怒。

source: I was going to ask him to explain more, but then he died.
zh_cn: 我想让他再多解释一点，但接下来他就死了。

source: My point is: Girl makes me feel this way, like I am going to die.
zh_cn: 我的看法是：女孩让我有这种感觉，就像要死了一样。

source: There are many women in the world.
zh_cn: 世界上有很多女人。

source: By last count, seven.
zh_cn: 上一次数，是七个。

source: But she is the only one I ever loved.
zh_cn: 但她是我唯一曾经爱过的。

source: Girl lives on Black Mountain.
zh_cn: 女孩住在黑山。

source: It is called Black Mountain because (1) it is mountain and (2) it is covered in black rocks.
zh_cn: 那地方叫做黑山是因为（1）它是一座山（2）它上面布满了黑色的石头。

source: Every day, Girl has to climb over the rocks to get to the river.
zh_cn: 每天，女孩都要爬过那些石头到河边去。

source: It is too hard.
zh_cn: 这太难了。

source: She has small legs and she is often getting stuck.
zh_cn: 她的双腿细小，常被石头卡住。

source: So one day I decided, "I will clear a path from Girl's cave to the river."
zh_cn: 所以有一天，我决定，“我要从女孩的洞到河边，清出一条道路来。”

source: I have been working on Girl's path for many years, picking up the black rocks and carrying them away.
zh_cn: 我为女孩的这条路干了许多年，搬起黑石头，把他们拿走。

source: I never throw her rocks off the cliff like normal rocks. Instead, I put them in a pile next to my cave.
zh_cn: 我从没有把她的石头像一般石头那样扔下山崖，而是把它们在我的洞边堆成一堆。

source: I like to look at the pile, because it reminds me of how I am helping Girl.
zh_cn: 我喜欢看这个石头堆，因为它让我想起我是怎么帮助女孩的。

source: My mother, who I live with, says the pile "has to go."
zh_cn: 我妈妈，跟我生活在一起，她说这个石堆“得离开这儿。“

source: (I worry that she will move the pile, but it is unlikely.
zh_cn: （我担心她会把石堆挪走，但那是不可能的。

source: After all, she is an elderly thirty-two-year-old woman.)
zh_cn: 毕竟，她是个上了年纪的，32岁的女人啦。）

source: I have made good progress on Girl's path, but there are still many rocks left.
zh_cn: 我在女孩的这条路上进展不错，但还是有很多石头要搬。

source: The job would go faster, but I am clearing the path in secret by the light of the moon.
zh_cn: 工作必须得加快，不过我一直只能在月光下偷偷干。

source: The reason is- and this is a hard thing to admit- I am afraid to talk to Girl.
zh_cn: 因为-很难承认这事儿-我害怕跟女孩讲话。

source: If she found out it was me clearing all the rocks, I'm sure she would say something to me like "Hello" or "Hi there."
zh_cn: 要是她发现是我在为她清除石头，我保证她会对我说点什么，”嗨“，或者”你好啊“什么的。

source: And then I would be in trouble.
zh_cn: 然后,我就有麻烦了。

source: Because the truth is I am not so good at making words.
zh_cn: 因为说真的，我不大会说话。

source: Boog is very good at making words.
zh_cn: 波戈非常善于讲话。

source: For example, last week he showed off his new picture at the Main Cave.
zh_cn: 例如上周，他在主洞里展示他的新作。

source: Everyone was expecting it to be a horse or a bear (all his pictures so far have been horses, bears, or a mix of horses and bears).
zh_cn: 大家都期待会是一匹马或一头鹿(目前为止，他画的要么是马，要么是鹿，要么是马和鹿混在一堆儿）。

source: But this picture was not of any animal. It was just a bunch of red streaks.
zh_cn: 但这次他画的不是动物，只是一些条纹。

source: People were angry.
zh_cn: 大家生气了。

source: "I wanted animals," the Old Person said.
zh_cn: “我要动物，”老人说。

source: "Where are the animals?"
zh_cn: “动物在哪里？”

source: It was bad situation.
zh_cn: 这是坏情况。

source: I thought that Boog would lose his job or maybe be killed by stones.
zh_cn: 我想波戈可能会丢掉工作，或者被石头砸死。

source: But then Boog stood on a rock and spoke.
zh_cn: 但波戈站上岩石，开始讲话。

source: "My art is smart," he said.
zh_cn: “我的艺术是机智的,"他说。

source: "And anyone who does not get it is stupid."
zh_cn: “不懂它的人是愚蠢的。”

source: Everyone was quiet.
zh_cn: 大家都沉默了。

source: We looked at the Old Person to see what he would say.
zh_cn: 我们看着老人，想听他怎么说。

source: The Old Person squinted at the red streaks for a while.
zh_cn: 老人眯起眼看了一会儿那些条纹。

source: Then he rubbed his chin and said, "Oh, yes, now I get it.
zh_cn: 然后他用手擦了擦下巴，说道，”哦，是的，现在我懂了。

source: It is smart.
zh_cn: 它是机智的。

source: People who do not get it are stupid."
zh_cn: 不懂的人是愚蠢的。“

source: A few seconds later, everyone else got it.
zh_cn: 几秒钟之后，其他人也都看懂了。

source: "It is smart," they said.
zh_cn: “它是机智的，”他们说。

source: "It is smart!"
zh_cn: “它是机智的！”

source: The only person who did not get it was me.
zh_cn: 只剩下我还没理解。

source: My beard began to sweat.
zh_cn: 我紧张得要命。

source: I was scared that someone would ask me to make words about the picture.
zh_cn: 我害怕有人要我发表看法。

source: I headed slowly for the exit.
zh_cn: 我慢慢走向出口。

source: I was almost out of the cave when Boog pointed his finger at me.
zh_cn: 当我就要走到洞外的时候，波戈用手指向我。

source: "Do you like it, Oog?"
zh_cn: “你喜欢它吗，奥戈？”

source: Everyone stopped making words and looked at me.
zh_cn: 所有人都停止说话，看着我。

source: "It is smart," I said.
zh_cn: “它是机智的,”我说。

source: I meant for my voice to sound big, but it came out small.
zh_cn: 我想要让自己的声音大点，但说出口的却还是很小声。

source: Boog smiled.
zh_cn: 波戈笑了。

source: "Ah," he said.
zh_cn: “哦，”他说。

source: "Then why don't you explain it to us?"
zh_cn: “那么为什么不解释一下给我们听?”

source: I felt a burning on my skin.
zh_cn: 我觉得我的皮肤像在燃烧。

source: It was sort of like when you fall into a cooking fire and your body catches on fire.
zh_cn: 就像掉进做饭的火里，浑身都着了。

source: I looked at my feet and people started laughing.
zh_cn: 我看着我的双脚，人们开始大声笑。

source: I looked up at Girl to see if she was one of the ones laughing.
zh_cn: 我抬头看向女孩，看她是不是也在笑。

source: She was not (thank Gods).
zh_cn: 她没有（谢天谢地）。

source: But she could hear all the other people laughing and that was just as bad.
zh_cn: 但是她能听见其他人在笑，这一样糟糕。

source: "I am tired from talking to people who are less smart," Boog said.
zh_cn: “我讨厌跟不够聪明的人讲话，”波戈说。

source: "I am going to mate with Girl now."
zh_cn: “我现在要跟女孩交配。”

source: He took Girl's hand and started to mate with her.
zh_cn: 他拿过女孩的手，开始跟她交配。

source: Some people stayed to watch, but most took this as their cue to leave.
zh_cn: 有些人留下来观看，但大多数人认为这是暗示他们离开。

source: On my way out, I heard Girl making sounds.
zh_cn: 在我出去的时候，我听到女孩在发出声音。

source: They stayed in my head all night, like an echo in an empty cave.
zh_cn: 那声音一整夜都在我脑子里，就像空洞里传来的回声。

source: The next day, I decided to become an Artist.
zh_cn: 第二天，我决定要做一个艺术家。

source: I told my plan to Oog (there are several of us named Oog- I'm sorry if it is confusing) and he said, "You can't be an Artist.
zh_cn: 我把计划告诉了奥戈（我们有好几人叫奥戈-很抱歉这让人困惑），他说，“你做不了艺术家。

source: It is hard."
zh_cn: 那很难。"

source: Oog agreed with him.
zh_cn: 奥戈同意他的看法。

source: "You're a Rock Thrower," he said.
zh_cn: “你是仍石头的，”他说。

source: "Stick with that."
zh_cn: “坚持做下去吧。”

source: I was angry at Oog.
zh_cn: 我对奥戈感到愤怒。

source: Partly because he always takes Oog's side.
zh_cn: 一部分是因为他总是支持奥戈。

source: But mostly because I did not agree with his words.
zh_cn: 但主要还是因为我不同意他的话。

source: Maybe Artist is hard job.
zh_cn: 也许艺术家很难当。

source: It is not for me to say.
zh_cn: 但对我来说不是如此。

source: But I would be surprised if it was as hard a job as Rock Thrower.
zh_cn: 如果当艺术家像仍石头一样难的话，我会感到吃惊的。

source: Throwing rocks is not so easy.
zh_cn: 仍石头没那么简单。

source: For example, five years ago one of my shoulders detached from my arm when I was throwing a boulder off the cliff.
zh_cn: 比如五年前，我把一块巨石扔下山崖的时候，一只肩膀跟胳膊脱开了。

source: And two years after that the other shoulder detached also.
zh_cn: 两年后，另一只肩膀也一样了。

source: I can still throw rocks off the cliff. But now when I throw them I am screaming.
zh_cn: 我现在仍然能把石头扔下山崖，不过仍的时候会喊叫。

source: Not just once in a while, but constantly.
zh_cn: 不是偶尔，而是一直。

source: Every time I throw a rock, I am screaming, loud.
zh_cn: 每当我仍一块石头，我都会喊叫，大声地。

source: I do not even realize I am screaming- it is just part of my life.
zh_cn: 我甚至意识不到我在喊叫-这只是生活的一部分。

source: Another thing is that sometimes I fall off the cliff, which is bad situation.
zh_cn: 另一件事是，我有时会掉下山崖，那是坏情况。

source: "I am going to make a picture," I told the others.
zh_cn: “我打算画张画儿，”我告诉其他人。

source: "A good one."
zh_cn: “一张好画。”

source: "Who are you going to show it to?" Oog said.
zh_cn: “你打算给谁看？”奥戈说。

source: "Your mother?"
zh_cn: “你妈妈?”

source: Everyone laughed: Oog, Oog, Moog, even Oog.
zh_cn: 所有人都笑了：奥戈，奥戈，摩戈，甚至还包括奥戈。

source: "No," I said.
zh_cn: “不，”我说。

source: "I will show it to Girl."
zh_cn: “我会给女孩看。”

source: No one made words after that.
zh_cn: 没有人再说话了。

source: I have never spoken to Girl, but one time she spoke to me.
zh_cn: 我没跟女孩说过话，但有一次她跟我说来着。

source: It was a long time ago, when we were still children.
zh_cn: 那是很久以前，我们还是孩子的时候。

source: It was the first day of school and we were learning to count.
zh_cn: 那是上学的第一天，我们学习数数。

source: It was confusing.
zh_cn: 那挺不好理解的。

source: I am very good at some numbers.
zh_cn: 我对一些数字比较擅长。

source: I understand "one" and "two" very well and I am O.K. with "three."
zh_cn: 我对“1”和“2”理解的非常好，“3”也没问题。

source: But when it gets to higher math, like "four" or "five," I have trouble.
zh_cn: 但更大的数，像“4”或“5”，就有困难了。

source: The Old Person had told us each to make a pile of five rocks.
zh_cn: 老人让我们每个人堆一个五块石头的石头堆。

source: I did not know how many that was and it was getting to be my turn.
zh_cn: 我不知道那是多少，而且就该轮到我了。

source: The Old Person was about to call on me, when Girl whispered in my ear.
zh_cn: 老人就要喊到我了，这时女孩轻声对我说话。

source: "You have too many rocks," she said.
zh_cn: “你的石头太多了，”她说。

source: "You need to take away four."
zh_cn: “你得拿走四块。”

source: I stared at her.
zh_cn: 我看着她。

source: I think she could tell from my eyes that I did not have a great grasp of "four."
zh_cn: 我相信她从我的眼睛里能看出来，我不大领会“4”的含义。

source: "It's two twos," she said.
zh_cn: “就是两个2，”她说。

source: I swallowed.
zh_cn: 我咽了口唾沫。

source: To this day, I do not know what she meant by this.
zh_cn: 直到今天，我也不知道她说的是什么意思。

source: "Don't worry," she said.
zh_cn: “别担心，”她说。

source: "I will help you."
zh_cn: “我会帮你。”

source: The Old Person was about to look at my pile when Girl stood up and pointed into the forest.
zh_cn: 老人正要查看我的石头堆时，女孩站起来，指着森林。

source: "Predator!" she yelled.
zh_cn: “猛兽！”她大喊。

source: By the time we came back from the Hiding Cave, it was night.
zh_cn: 等我们从躲避洞回来的时候，天已经黑了。

source: On the second day of school, we graduated and I got my sheepskin just like everybody else.
zh_cn: 上学的第二天，我们毕业了。我跟其他人一样，得到了羊皮。

source: I wanted to thank Girl, but I did not know which words to make.
zh_cn: 我想谢谢女孩，但不知道该说什么。

source: So I said nothing.
zh_cn: 所以我什么也没说。

source: Girl has a small head, so it is very strange how she fits so many things inside of it.
zh_cn: 女孩的头很小，她脑袋里能装那么多东西真是非常奇怪。

source: She knows all the numbers: "six," "eight"- you name it.
zh_cn: 她知道所有的数字：“6”，“8”-你说吧。

source: But she also knows other things nobody else knows.
zh_cn: 但是她还知道其他别人不知道的事儿。

source: One time, I followed her down to the river.
zh_cn: 有一次，我跟着她到来到河边。

source: She was hunting fish in the normal way, by jabbing a stick in the water.
zh_cn: 她正在用通常的方式捕鱼，用棍子向河里猛刺。

source: After a long time, she caught a small flat fish.
zh_cn: 过了很久，她逮到一条小鱼。

source: I assumed she would do the normal thing (rip off the head and eat the body), but instead she did the strangest thing I have ever seen.
zh_cn: 我猜想她会揪掉鱼头，吃掉身体，那是常规的做法。但她没有，她做了我见过的最奇怪的事。

source: She put the stick- with the small fish still on it- back into the river.
zh_cn: 她把棍子-前端还叉着小鱼-放回水里。

source: A short time later, she pulled the stick out.
zh_cn: 不一会儿，她把棍子拿出来。

source: A bigger fish was on the stick.
zh_cn: 棍子上有一条更大的鱼。

source: I do not understand how Girl did this.
zh_cn: 我不知道女孩是怎么做到的。

source: But I have thought a lot about what I saw, and I have developed a theory: she is a witch who knows magic.
zh_cn: 我想了很久，得出一个结论：她是会魔法的女巫。

source: Even though she is probably a witch, I still love her.
zh_cn: 尽管她可能是个女巫，我仍然爱她。

source: My mother says that when you love someone you love them despite their flaws.
zh_cn: 我妈妈说过，当你爱一个人的时候，会不顾他们的缺点。

source: For example, my father was not so good at hunting after a monster ate his arms.
zh_cn: 例如，我爸爸在被猛兽吃掉一条胳膊后，不那么能打猎了。

source: But my mother continued to mate with him, because she loved him.
zh_cn: 但我妈妈仍然跟他交配，因为她爱他。

source: Girl must really love Boog, because he has many flaws.
zh_cn: 女孩一定真的爱波戈，因为他有许多缺点。

source: He never smiles or shares his meat with other people.
zh_cn: 他从来不笑，也从不把肉分享给别人。

source: He is rude to the Old Person and will not rub his feet.
zh_cn: 他对老人粗鲁，不给他磨脚。

source: And he isn't very "down to earth."
zh_cn: 而且，他不怎么"实际。”

source: For example, one day he stood on the big rock and said, "Everyone should worship me, for I am a living God." Maybe he is right.
zh_cn: 例如，有一天他站在大石头上说，“每个人都该崇拜我，因为我是永生的神。”也许他是对的。

source: I do not know how all that works.
zh_cn: 我不知道那怎么可能。

source: But he doesn't have to say it on the rock.
zh_cn: 但他怎么也不该在岩石上说那话。

source: Boog's worst flaw, though, is that he disrespects Girl.
zh_cn: 波戈最糟的缺点，是不尊重女孩。

source: It is subtle, but if you watch him closely you can tell.
zh_cn: 尽管不明显，但如果你仔细观察就会发现。

source: For example, sometimes he orders her to mate with him in front of crowds.
zh_cn: 例如，有时候他会命令她在众人面前跟他交配。

source: I know this is his right (he is man, she is woman).
zh_cn: 我知道这是他的权力（他是男人，她是女人）。

source: But it is the way he orders her to mate that I do not like.
zh_cn: 但我不喜欢的是他命令女孩的方式。

source: He makes his voice big and snaps his fingers.
zh_cn: 他很大声地说，还打响指。

source: It is like he is talking to a dog.
zh_cn: 就像他在跟狗说话。

source: If I owned Girl, I would only command her to mate with me in front of crowds if it seemed like she was in the mood to do that.
zh_cn: 要是我拥有女孩，只有当她看起来有心思那么做的时候，我才会命令她在众人面前跟她交配。

source: Boog has a lot going for him.
zh_cn: 波戈拥有很多东西。

source: He is very wealthy (three skins).
zh_cn: 他很富有（三张皮子）。

source: He is maybe a God (unclear).
zh_cn: 他也许是个神（还不清楚）。

source: He styles his hair in the new cool way (wet).
zh_cn: 他有新酷的发型（弄湿）。

source: He invented Art. But I still cannot understand why Girl is with him.
zh_cn: 他发明了艺术。但我还是不能理解为什么女孩会跟着他。

source: As my father used to say, "There must be other monsters in that cave that we don't know about."
zh_cn: 就像我父亲常说的，“洞里一定还有你不知道的怪兽。”

source: I decided to make my picture of a horse, because I knew that was a thing.
zh_cn: 我决定要画一匹马，因为我知道那是很重要的画。

source: It took a long time, for many reasons: (1) I could only work nights, because of my rock-throwing job; (2) it was my first time making Art; and (another reason) my mother was watching over my shoulder the whole time and making words.
zh_cn: 这花了我很长时间，因为很多原因：（1）我只能夜里工作，因为我扔石头的工作；（2）这是我第一次搞艺术；（另一个原因）我妈妈总是一直在我身后观看，还说个不停。”

source: "You are bad at this," she said.
zh_cn: 你不适合干这个。

source: I love my mother and will always rub her feet, but sometimes I think she does not know how to help.
zh_cn: “我爱我妈妈，我会永远为她磨脚，但有时候我认为她不知道怎么帮我。
